{
  "landing": {
    "sectionTitle": "LUCAS OLIVEIRA",
    "subtitle": "Desenvolvedor Web em São Paulo"
  },
  "aboutMe": {
    "headerTitle": "Sobre",
    "sectionTitle": "Ola, eu sou Lucas Oliveira, desenvolvedor web e entusiasta da tecnologia.",
    "content": [
      {
        "title": "Sobre mim.",
        "text": [
          "Sou um cara de 21 anos, estudante de ciência da computação e trabalhando como desenvolvedor Front end para e-commerces com Vtex.",
          "Atualmente trabalhando no meu projeto de conclusão de curso, sobre Visão Computacional e identificação de doenças em plantas de tomate, e desenvolvendo para Motorola Índia no meu trabalho.",
          "Trabalhei desenvolvendo para diversos e-commerces criando suas home pages e suas páginas de produto, criando componentes e ajustando componentes já implementados.",
          "Atualmente estudando JavaScript e seus framworks para melhorar meu conhecimento como desenvolvedor Front end."
        ]
      },
      {
        "title": "Background",
        "text": [
          "Competição de programação.",
          "Sair com amigos. ",
          "Animes. ",
          "Assistir filmes. ",
          "Ouvir novas musicas",
          "Jogar video games"
        ]
      }
    ]
  },
  "resume": {
    "sectionTitle": "Resumo",
    "headerTitle": "Resumo",
    "cards": [
      {
        "jobTitle": "Desenvolvedor Front-End React + vtex",
        "company": "Corebiz",
        "startDate": "Ago 2021",
        "endDate": "Atualmente",
        "description": "Atuo com o desenvolvimento Front end em Ambiente Vtex para E-Commerces desenvolvendo novas páginas para o website seguindo layout definido por um Designer, desenvolvendo também novas funcionalidades e corrigindo problemas e atualizando as funcionalidades pré-implementadas. Trabalho em metodologia ágil realizando sprint e seguindo modelo kanban para alinhamento de tarefas internas do dia a dia. Atuei no desenvolvimento do lançamento do e-commerce de Motorola USA e atuei sendo o principal desenvolvedor para o lançamento do e-commerce de Motorola Índia."
      },
      {
        "jobTitle": "Estágio em infraestrutura",
        "company": "Faurecia automotive do Brasil",
        "startDate": "Ago 2019",
        "endDate": "Ago 2021",
        "description": "Atuei com a manutenção e suporte com os equipamentos de IT como notebooks, desktops e impressoras. Gerenciamento da rede e sistemas internos, controle e organização dos equipamentos na fábrica e gerenciamento diário de KPIs e indicadores. "
      }
    ]
  },
  "services": {
    "sectionTitle": "Habilidades",
    "headerTitle": "Habilidades",
    "skills": {
      "soft": {
        "desktop": [
          {
            "title": "[Vtex IO]",
            "subtitle": "Desenvolvimento em ambiente vtex para e-commerces."
          },
          {
            "title": "[Desenvolvimento web]",
            "subtitle": "Desenvolvimento Full stack para web. Front end e Back end"
          },
          {
            "title": "[Metodologia Ágil]",
            "subtitle": "Trabalho em metodologia ágil, seguindo os ritos e sempre aplicando melhoria contínua."
          },
          {
            "title": "[Git / GitFlow]",
            "subtitle": "Conhecimento avançado em Git e GitFlow."
          }
        ],
        "mobile": [
          "Vtex IO",
          "Desenvolvimento web",
          "Metodologia Ágil",
          "Git / GitFlow"
        ]
      },
      "hard": {
        "desktop": [
          {
            "title": "[ReactJS]",
            "subtitle": "Conhecimento avançado em desenvolvimento front end com ReactJS"
          },
          {
            "title": "[Sass, Stylus, Less]",
            "subtitle": "Conhecimento em pré-processadores CSS"
          },
          {
            "title": "[Jquery]",
            "subtitle": "Conhecimento intermediário em jquery"
          },
          {
            "title": "[HTML / CSS]",
            "subtitle": "Conhecimento avançado em HTML e CSS para desenvolvimento web"
          },
          {
            "title": "[JavaScript / Typescript]",
            "subtitle": "Conhecimento avançado em JavaScript sendo minha principal linguagem. Conhecimento em Typescript"
          },
          {
            "title": "[NodeJS]",
            "subtitle": "Médio conhecimento em trabalho com back end com NodeJS"
          },
          {
            "title": "[Angular]",
            "subtitle": "Conhecimento em desenvolvimento com Angular 8"
          }
        ],
        "mobile": [
          "ReactJS",
          "SASS / Stylus / Less",
          "Jquery",
          "HTML / CSS",
          "JavaScript / TypeScript",
          "NodeJS",
          "Angular"
        ]
      }
    }
  },
  "works": {
    "sectionTitle": "Trabalhos",
    "headerTitle": "Trabalhos",
    "seeMoreText": "ver projeto",
    "personalProjects": {
      "title": "Projetos pessoais.",
      "projects": []
    },
    "backgroundProjects": {
      "title": "Projetos em que atuei.",
      "projects": [
        {
          "projectTitle": "Motorola Índia",
          "description": "Meu projeto atual onde trabalho. Desenvolvo para o time de Motorola Índia sendo eu o principal desenvolvedor do projeto. Nesse projeto nós desenvolvemos o novo e-commerce para Motorola Índia. Eu trabalho como dev lead no projeto, ajudando os outros desenvolvedores, realizando code review e aprovando pool requests e realizando as tarefas mais difíceis. Sendo um dev lead, consegui aprender a ser mais acessível ao meu time e pude melhorar meu conhecimento em React e Vtex IO. Além do projeto, eu consegui evoluir muito meu inglês visto que estou agora  em contato diário com time de Índia da Motorola para alinhamento do progresso do projeto",
          "background": "https://i.imgur.com/zHoT8tu.png",
          "urlToProject": "https://www.motorola.in",
          "tags": []
        },
        {
          "projectTitle": "Motorola US",
          "description": "Primeiro projeto em que desenvolvi utilizando Vtex IO. Neste projeto trabalhei desenvolvendo alguns componentes para lançamento da nova pagina de produto para lançamento do Edge 30 Pro. Nesse projeto pude trabalhar em um time de dedicados e trabalhar em contato direto com o time de marketing de Motorola USA o que me fez adquirir muito conhecimento sobre desenvolvimento web. Além de trabalhar com desenvolvedores de alto nível e poder melhorar minhas habilidades com desenvolvimento web pude também ter o pontapé inicial para melhorar meu inglês, o que foi uma grande oportunidade para mim.",
          "background": "https://i.imgur.com/EXM3era.png",
          "urlToProject": "www.motorola.com/us/smartphones-motorola-edge-plus-gen-2/p",
          "tags": []
        },
        {
          "projectTitle": "Karsten / Trussardi",
          "description": "Trabalho para e-commerce de Karsten e Trussardi desenvolvendo novas funcionalidades e fixando funcionalidades já implementadas. Comecei minha carreira como Front end nestas duas lojas e pude aprender muito sobre desenvolvimento web e vtex. Trabalhei utilizando vtex legacy, HTML e CSS.",
          "background": "https://i.imgur.com/nQOAGmi.png",
          "urlToProject": "https://www.karsten.com.br",
          "tags": []
        },
        {
          "projectTitle": "BabadoTop",
          "description": "Projeto mais difícil em que atuei. Trabalhei por 2 meses e aprendi bastante sobre desenvolvimento avançado de componentes com ReactJS. Nesse projeto criei um componente que funcionava como um stories do Instagram porem ainda mostrava uma prateleira de produtos para que o cliente que estivesse vendo já pudesse comprar direto do 'storie'. Trabalhei utilizando Vtex legacy com HTML e CSS e desenvolvendo componentes customizados com React JS",
          "background": "https://i.imgur.com/EsOEylE.png",
          "urlToProject": "https://www.babadotop.com.br",
          "tags": []
        }
      ]
    }
  },
  "contact": {
    "title": "[Contato]",
    "headerTitle": "Contato",
    "contacts": [
      {
        "type": "[Email]",
        "linkText": "lucassioliveira098@gmail.com",
        "urlLink": "mailto:lucasisoliveira098@gmail.com?subject = Contact"
      },
      {
        "type": "[LinkedIn]",
        "linkText": "Lucas Oliveira",
        "urlLink": "https://linkedin.com/in/lucas-oliveira-997810198/"
      },
      {
        "type": "[GitHub]",
        "linkText": "lukaskunn",
        "urlLink": "https://github.com/lukaskunn"
      }
    ]
  }
}
